
-- 插入
INSERT INTO college(college_id,college_name) VALUES
(1, '能源与动力学院'),
(2, '电子信息工程学院'),
(3, '自动化学院'),
(4, '计算机科学与技术学院'),
(5, '机电学院'),
(6, '材料科学与技术学院'),
(7, '民航学院'),
(8, '经济与管理学院'),
(9, '人文与社会科学学院'),
(10, '外国语学院');

INSERT INTO classroom(classroom_id,classroom_name) VALUES
(1404, '巡天楼404'),
(1102, '巡天楼102'),
(1201, '巡天楼201'),
(1501, '巡天楼501'),
(1207, '巡天楼207'),
(2301, '牧星楼301'),
(2302, '牧星楼302'),
(2311, '牧星楼311'),
(3401, 'C栋401'),
(3301, 'C栋301');

-- 向 student 表插入 5 条数据
INSERT INTO student (Sno, Sname, sex, Sbirthday, college_name, GPA, spassword)
VALUES 
('162310305', '赵六', '男', '2004-08-15', '能源与动力学院', 3.0, '112233'),
('162310306', '孙七', '女', '2003-12-05', '自动化学院', 2.9, '332211'),
('162310307', '周八', '男', '2005-06-20', '材料科学与技术学院', 3.1, '445566'),
('162310308', '吴九', '女', '2004-07-10', '电子信息工程学院', 2.7, '665544'),
('162310309', '郑十', '男', '2003-09-25', '民航学院', 3.3, '778899');

-- 向 course 表插入 14 条带具体教师信息的课程数据
INSERT INTO course (Cno, Cname, Tname, Credit, Ctype, classroomname, evaluationmode)
VALUES 
('01020307', '大学语文', '林诗韵', 3, '必修课', 'C栋301', '考试'),
('01020308', '计算机基础', '陈宇轩', 4, '必修课', 'C栋401', '考试'),
('01020309', '体育', '赵睿', 2, '必修课', '巡天楼102', '考查'),
('01020310', '政治经济学', '苏墨', 3, '必修课', '巡天楼201', '考试'),
('01020311', '高等数学（二）', '吴启明', 5, '必修课', '巡天楼207', '考试'),
('01020312', '大学物理实验', '郑晓萱', 2, '选修课', '巡天楼404', '考查'),
('01020313', '线性代数', '王逸飞', 3, '必修课', '巡天楼501', '考试'),
('01020314', '数据库原理', '刘思语', 4, '选修课', '牧星楼301', '考试'),
('01020315', 'Java 编程', '张逸尘', 4, '选修课', '牧星楼302', '考查'),
('01020316', '操作系统', '李悦然', 3, '必修课', '牧星楼311', '考试'),
('01020317', '数据结构', '陈雨泽', 4, '必修课', 'C栋301', '考试'),
('01020318', '计算机网络', '崔雅琴', 3, '选修课', 'C栋401', '考查'),
('01020319', '软件工程', '吴宇澄', 4, '必修课', '巡天楼102', '考试'),
('01020320', '人工智能导论', '王诗涵', 3, '选修课', '巡天楼201', '考查');

